---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFC.PushTransform(Autodesk.Revit.DB.Transform)
source: html/bc1f8a42-7cbc-600a-9d1f-bcf80d6186e0.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.PushTransform Method

Sets the internal transform of the exporter to process the geometry and properties of the input element.

## Syntax (C#)
```csharp
public void PushTransform(
	Transform trf
)
```

## Parameters
- **trf** (`Autodesk.Revit.DB.Transform`) - The transform.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null